In [1]:
import pandas as pd
df_credit = pd.read_csv('https://www.littledataman.com/samples/credit.csv', parse_dates = ['Approval Date'])
df_cards = pd.read_csv('https://www.littledataman.com/samples/cards.csv', parse_dates = ['Effective Date'])
df_trans = pd.read_csv('https://www.littledataman.com/samples/transactions.csv', parse_dates = ['Date'])

In [4]:
df_cards_1 = df_cards[:3]
df_trans_1 = df_trans[df_trans['Card Number'].isin (['CN014', 'CN015',
'CN016'])]

In [5]:
df_cards_1 = df_cards_1.set_index('Card Number')
df_cards_1.merge(df_trans_1 , left_index = True, right_on = 'Card Number', how='inner')

,First Name,Last Name,Limitation,Effective Date,Card Number,Date,Transactions,Amount
1,Jane,Nize,9800,2019-08-16 05:25:00,CN014,2019-09-01,3,120.50
8,Jane,Nize,9800,2019-08-16 05:25:00,CN014,2019-09-03,2,23.60
2,Henry,Tone,12000,2019-09-13 12:00:00,CN015,2019-09-01,1,53.23
5,Henry,Tone,12000,2019-09-13 12:00:00,CN015,2019-09-02,2,23.12

In [6]:
df_cards.join(df_trans, lsuffix = '_l')

,First Name,Last Name,Card Number_l,Limitation,Effective Date,Card Number,Date,Transactions,Amount
0,Jacky,White,CN012,10000,2019-09-13 12:00:00,CN012,2019-09-01,2,356.20
1,Jane,Nize,CN014,9800,2019-08-16 05:25:00,CN014,2019-09-01,3,120.50
2,Henry,Tone,CN015,12000,2019-09-13 12:00:00,CN015,2019-09-01,1,53.23
3,Desmond,Black,CN016,5000,2019-08-16 05:25:00,CN016,2019-09-01,3,25.60
4,Henry,Tone,CN015,15000,2020-05-01 12:00:00,CN012,2019-09-02,5,785.00
5,Desmond,Black,CN016,2000,2020-05-01 01:00:00,CN015,2019-09-02,2,23.12

In [7]:
df_cards.set_index('Card Number').join(df_trans.set_index('Card Number'),
how = 'left' )

,First Name,Last Name,Limitation,Effective Date,Date,Transactions,Amount
Card Number,,,,,,,
CN012,Jacky,White,10000,2019-09-13 12:00:00,2019-09-01,2,356.20
CN012,Jacky,White,10000,2019-09-13 12:00:00,2019-09-02,5,785.00
CN012,Jacky,White,10000,2019-09-13 12:00:00,2019-09-03,4,36.90
CN014,Jane,Nize,9800,2019-08-16 05:25:00,2019-09-01,3,120.50
CN014,Jane,Nize,9800,2019-08-16 05:25:00,2019-09-03,2,23.60
CN015,Henry,Tone,12000,2019-09-13 12:00:00,2019-09-01,1,53.23
CN015,Henry,Tone,12000,2019-09-13 12:00:00,2019-09-02,2,23.12
CN015,Henry,Tone,15000,2020-05-01 12:00:00,2019-09-01,1,53.23
CN015,Henry,Tone,15000,2020-05-01 12:00:00,2019-09-02,2,23.12
CN016,Desmond,Black,5000,2019-08-16 05:25:00,2019-09-01,3,25.60
CN016,Desmond,Black,5000,2019-08-16 05:25:00,2019-09-02,3,28.30
CN016,Desmond,Black,5000,2019-08-16 05:25:00,2019-09-03,4,43.50
CN016,Desmond,Black,2000,2020-05-01 01:00:00,2019-09-01,3,25.60
CN016,Desmond,Black,2000,2020-05-01 01:00:00,2019-09-02,3,28.30
CN016,Desmond,Black,2000,2020-05-01 01:00:00,2019-09-03,4,43.50

In [8]:
df_cards

  First Name Last Name Card Number  Limitation      Effective Date
0      Jacky     White       CN012       10000 2019-09-13 12:00:00
1       Jane      Nize       CN014        9800 2019-08-16 05:25:00
2      Henry      Tone       CN015       12000 2019-09-13 12:00:00
3    Desmond     Black       CN016        5000 2019-08-16 05:25:00
4      Henry      Tone       CN015       15000 2020-05-01 12:00:00
5    Desmond     Black       CN016        2000 2020-05-01 01:00:00

In [9]:
pd.concat([df_cards, df_trans], axis = 1, join ='inner')

,First Name,Last Name,Card Number,Limitation,Effective Date,Card Number,Date,Transactions,Amount
0,Jacky,White,CN012,10000,2019-09-13 12:00:00,CN012,2019-09-01,2,356.20
1,Jane,Nize,CN014,9800,2019-08-16 05:25:00,CN014,2019-09-01,3,120.50
2,Henry,Tone,CN015,12000,2019-09-13 12:00:00,CN015,2019-09-01,1,53.23
3,Desmond,Black,CN016,5000,2019-08-16 05:25:00,CN016,2019-09-01,3,25.60
4,Henry,Tone,CN015,15000,2020-05-01 12:00:00,CN012,2019-09-02,5,785.00
5,Desmond,Black,CN016,2000,2020-05-01 01:00:00,CN015,2019-09-02,2,23.12

In [10]:
pd.concat([df_cards, df_trans], axis = 1, join ='outer')

,First Name,Last Name,Card Number,Limitation,Effective Date,Card Number,Date,Transactions,Amount
0,Jacky,White,CN012,10000.0,2019-09-13 12:00:00,CN012,2019-09-01,2,356.20
1,Jane,Nize,CN014,9800.0,2019-08-16 05:25:00,CN014,2019-09-01,3,120.50
2,Henry,Tone,CN015,12000.0,2019-09-13 12:00:00,CN015,2019-09-01,1,53.23
3,Desmond,Black,CN016,5000.0,2019-08-16 05:25:00,CN016,2019-09-01,3,25.60
4,Henry,Tone,CN015,15000.0,2020-05-01 12:00:00,CN012,2019-09-02,5,785.00
5,Desmond,Black,CN016,2000.0,2020-05-01 01:00:00,CN015,2019-09-02,2,23.12
6,NaN,NaN,NaN,NaN,NaT,CN016,2019-09-02,3,28.30
7,NaN,NaN,NaN,NaN,NaT,CN012,2019-09-03,4,36.90
8,NaN,NaN,NaN,NaN,NaT,CN014,2019-09-03,2,23.60
9,NaN,NaN,NaN,NaN,NaT,CN016,2019-09-03,4,43.50

In [11]:
pd.concat([df_cards_1 ,df_trans_1],axis = 0,join ='inner', sort=False )

Empty DataFrame
Columns: []
Index: [CN012, CN014, CN015, 1, 2, 3, 5, 6, 8, 9]

In [12]:
df_cards.append(df_trans,sort=False)

,First Name,Last Name,Card Number,Limitation,Effective Date,Date,Transactions,Amount
0,Jacky,White,CN012,10000.0,2019-09-13 12:00:00,NaT,NaN,NaN
1,Jane,Nize,CN014,9800.0,2019-08-16 05:25:00,NaT,NaN,NaN
2,Henry,Tone,CN015,12000.0,2019-09-13 12:00:00,NaT,NaN,NaN
3,Desmond,Black,CN016,5000.0,2019-08-16 05:25:00,NaT,NaN,NaN
4,Henry,Tone,CN015,15000.0,2020-05-01 12:00:00,NaT,NaN,NaN
5,Desmond,Black,CN016,2000.0,2020-05-01 01:00:00,NaT,NaN,NaN
0,NaN,NaN,CN012,NaN,NaT,2019-09-01,2.0,356.20
1,NaN,NaN,CN014,NaN,NaT,2019-09-01,3.0,120.50
2,NaN,NaN,CN015,NaN,NaT,2019-09-01,1.0,53.23
3,NaN,NaN,CN016,NaN,NaT,2019-09-01,3.0,25.60
4,NaN,NaN,CN012,NaN,NaT,2019-09-02,5.0,785.00
5,NaN,NaN,CN015,NaN,NaT,2019-09-02,2.0,23.12
6,NaN,NaN,CN016,NaN,NaT,2019-09-02,3.0,28.30
7,NaN,NaN,CN012,NaN,NaT,2019-09-03,4.0,36.90
8,NaN,NaN,CN014,NaN,NaT,2019-09-03,2.0,23.60
9,NaN,NaN,CN016,NaN,NaT,2019-09-03,4.0,43.50